In [167]:
import pandas as pd
import re
import datetime
import numpy as np
from dateutil.relativedelta import relativedelta
from datetime import date

In [135]:
claims = pd.read_parquet("claims.parquet")

In [136]:
claims.head()

        pol  property start_date         amount
0  0152f838      7019  25Oct2018  157866.849557
1  0152f838      7019  25Oct2018  918867.179064
2  0152f838      7019  25Oct2018  128602.395049
3  0152f838      7019  25Oct2018  447153.652892
4  0152f838      7019  25Oct2018  221691.940430

In [137]:
claims_date = claims.start_date.str.extract('(?P<day>\d+)(?P<month>[A-Za-z]{3})(?P<year>.*)')
claims_date['year'].replace(regex=True, inplace=True, to_replace=r'[^0-9]', value=r'')
claims_cleandate = pd.concat([claims, claims_date], axis=1)
claims_cleandate.drop(['start_date'], axis = 1, inplace = True)
claims_cleandate['start_date'] = pd.to_datetime(claims_cleandate['year'].astype(str)  + claims_cleandate['month'] + claims_cleandate['day'].astype(str), format='%Y%b%d', errors = 'coerce')
claims_cleandate.drop(['day', 'month', 'year'], axis = 1, inplace = True)

In [138]:
claims_cleandate

            pol  property         amount start_date
0      0152f838      7019  157866.849557 2018-10-25
1      0152f838      7019  918867.179064 2018-10-25
2      0152f838      7019  128602.395049 2018-10-25
3      0152f838      7019  447153.652892 2018-10-25
4      0152f838      7019  221691.940430 2018-10-25
...         ...       ...            ...        ...
62560  bcb9c7aa      2622  247746.381133 2018-04-12
62561  bcb9c7aa      2622  877838.367428 2018-04-12
62562  bcb9c7aa      2622  975262.895901 2018-04-12
62563  bcb9c7aa      2622  238795.524908 2018-04-12
62564  bcb9c7aa      2622  242354.159700 2018-04-12

[62565 rows x 4 columns]

In [7]:
policies = pd.read_excel("policies.xlsx",engine = "openpyxl")

In [6]:
pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.0.9-py2.py3-none-any.whl (242 kB)
     |████████████████████████████████| 242 kB 3.4 MB/s eta 0:00:01
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.0.9
Note: you may need to restart the kernel to use updated packages.

In [206]:
policies['pol'].value_counts()

f976a747    4
1edad92c    4
206daa37    4
03d18350    4
bd8d5692    4
           ..
c0c31cc6    1
66e20e0c    1
5df4372c    1
5d3eca51    1
7908e09d    1
Name: pol, Length: 1000, dtype: int64

In [140]:
policies_start = policies.start.str.extract('(?P<day>\d+)(?P<month>[A-Za-z]{3})(?P<year>.*)')
policies_start['year'].replace(regex=True, inplace=True, to_replace=r'[^0-9]', value=r'')
policies_start1 = pd.concat([policies, policies_start], axis=1)
policies_start1.drop(['start'], axis = 1, inplace = True)
policies_start1['start_date'] = pd.to_datetime(policies_start1['year'].astype(str)  + policies_start1['month'] + policies_start1['day'].astype(str), format='%Y%b%d', errors = 'coerce')
policies_start1.drop(['day', 'month', 'year'], axis = 1, inplace = True)

In [146]:
policies_start1.head()

        pol         end start_date
0  11bb0dd0   4Jun.2019 2018-06-04
1  96a3c554   25Jan2018 2017-01-25
2  35a90ece   26Oct2019 2018-10-26
3  6d034563   3Aug.2018 2017-08-03
4  c70d089a  28Nov.2018 2017-11-28

In [152]:
policies_end = policies_start1.end.str.extract('(?P<day>\d+)(?P<month>[A-Za-z]{3})(?P<year>.*)')
policies_end['year'].replace(regex=True, inplace=True, to_replace=r'[^0-9]', value=r'')
policies_end1 = pd.concat([policies_start1, policies_end], axis=1)
policies_end1.drop(['end'], axis = 1, inplace = True)
policies_end1['end_date'] = pd.to_datetime(policies_end1['year'].astype(str)  + policies_end1['month'] + policies_end1['day'].astype(str), format='%Y%b%d', errors = 'coerce')
policies_end1.drop(['day', 'month', 'year'], axis = 1, inplace = True)

In [154]:
policies_end1

           pol start_date   end_date
0     11bb0dd0 2018-06-04 2019-06-04
1     96a3c554 2017-01-25 2018-01-25
2     35a90ece 2018-10-26 2019-10-26
3     6d034563 2017-08-03 2018-08-03
4     c70d089a 2017-11-28 2018-11-28
...        ...        ...        ...
1755  bc0383e3 2016-08-17 2017-08-17
1756  e543ca86 2015-04-06 2016-04-06
1757  5cfb6cf2 2018-01-13 2019-01-13
1758  0831ffa4 2018-02-19 2019-02-19
1759  a4bfa3b8 2016-04-05 2017-04-05

[1760 rows x 3 columns]

In [161]:
policies_end1.dropna(inplace = True)

In [162]:
policies_end1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1753 entries, 0 to 1759
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   pol         1753 non-null   object
 1   start_date  1753 non-null   datetime64[ns]
 2   end_date    1753 non-null   datetime64[ns]
dtypes: datetime64[ns](2), object(1)
memory usage: 54.8+ KB

In [9]:
properties = pd.read_csv("properties.csv")

In [157]:
claims_cleandate.dropna(inplace = True)

In [158]:
claims_cleandate

            pol  property         amount start_date
0      0152f838      7019  157866.849557 2018-10-25
1      0152f838      7019  918867.179064 2018-10-25
2      0152f838      7019  128602.395049 2018-10-25
3      0152f838      7019  447153.652892 2018-10-25
4      0152f838      7019  221691.940430 2018-10-25
...         ...       ...            ...        ...
62560  bcb9c7aa      2622  247746.381133 2018-04-12
62561  bcb9c7aa      2622  877838.367428 2018-04-12
62562  bcb9c7aa      2622  975262.895901 2018-04-12
62563  bcb9c7aa      2622  238795.524908 2018-04-12
62564  bcb9c7aa      2622  242354.159700 2018-04-12

[62482 rows x 4 columns]

In [163]:
policies_end1

           pol start_date   end_date
0     11bb0dd0 2018-06-04 2019-06-04
1     96a3c554 2017-01-25 2018-01-25
2     35a90ece 2018-10-26 2019-10-26
3     6d034563 2017-08-03 2018-08-03
4     c70d089a 2017-11-28 2018-11-28
...        ...        ...        ...
1755  bc0383e3 2016-08-17 2017-08-17
1756  e543ca86 2015-04-06 2016-04-06
1757  5cfb6cf2 2018-01-13 2019-01-13
1758  0831ffa4 2018-02-19 2019-02-19
1759  a4bfa3b8 2016-04-05 2017-04-05

[1753 rows x 3 columns]

In [189]:
policies_end1['term'] = policies_end1['end_date'] - policies_end1['start_date']
policies_end1['term'] = (policies_end1['term']/ datetime.timedelta(days = 365)).astype(int)

In [195]:
policies_end1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1753 entries, 0 to 1759
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   pol         1753 non-null   object
 1   start_date  1753 non-null   datetime64[ns]
 2   end_date    1753 non-null   datetime64[ns]
 3   term        1753 non-null   int64
dtypes: datetime64[ns](2), int64(1), object(1)
memory usage: 68.5+ KB

In [210]:
properties

      prop_id       pol state   sqft  age
0        7019  0152f838    OH  10876   67
1        8025  604b4377    AZ  87946   95
2        5766  b7007f67    FL  57978   13
3        6120  bae6a6d7    AZ  89202   53
4        1468  a5916966    AZ  35934   29
...       ...       ...   ...    ...  ...
8408     7420  12252bd4    FL  20467   97
8409       56  9c8cc91b    AZ  63535   18
8410     6112  bae6a6d7    AZ  30211   58
8411     2622  bcb9c7aa    AZ  69492   72
8412     4983  f7187fa9    FL  60814   62

[8413 rows x 5 columns]

In [208]:
policies_end1

           pol start_date   end_date  term
0     11bb0dd0 2018-06-04 2019-06-04     1
1     96a3c554 2017-01-25 2018-01-25     1
2     35a90ece 2018-10-26 2019-10-26     1
3     6d034563 2017-08-03 2018-08-03     1
4     c70d089a 2017-11-28 2018-11-28     1
...        ...        ...        ...   ...
1755  bc0383e3 2016-08-17 2017-08-17     1
1756  e543ca86 2015-04-06 2016-04-06     1
1757  5cfb6cf2 2018-01-13 2019-01-13     1
1758  0831ffa4 2018-02-19 2019-02-19     1
1759  a4bfa3b8 2016-04-05 2017-04-05     1

[1753 rows x 4 columns]

In [214]:
result = pd.merge(claims_cleandate, properties, left_on = "property", right_on = "prop_id", how = "inner")

In [219]:
result.drop(['pol_x', 'property'], inplace = True, axis = 1)

In [224]:
result.rename(columns = {'pol_y': 'pol'}, inplace = True)

In [225]:
result

              amount start_date  prop_id       pol state   sqft  age
0      157866.849557 2018-10-25     7019  0152f838    OH  10876   67
1      918867.179064 2018-10-25     7019  0152f838    OH  10876   67
2      128602.395049 2018-10-25     7019  0152f838    OH  10876   67
3      447153.652892 2018-10-25     7019  0152f838    OH  10876   67
4      221691.940430 2018-10-25     7019  0152f838    OH  10876   67
...              ...        ...      ...       ...   ...    ...  ...
62477  247746.381133 2018-04-12     2622  bcb9c7aa    AZ  69492   72
62478  877838.367428 2018-04-12     2622  bcb9c7aa    AZ  69492   72
62479  975262.895901 2018-04-12     2622  bcb9c7aa    AZ  69492   72
62480  238795.524908 2018-04-12     2622  bcb9c7aa    AZ  69492   72
62481  242354.159700 2018-04-12     2622  bcb9c7aa    AZ  69492   72

[62482 rows x 7 columns]

In [228]:
result_final = pd.merge(result, policies_end1, on = ['pol', 'start_date'], how = "outer")

In [229]:
result_final

,amount,start_date,prop_id,pol,state,sqft,age,end_date,term
0,157866.849557,2018-10-25,7019,0152f838,OH,10876,67,2019-10-25,1.0
1,918867.179064,2018-10-25,7019,0152f838,OH,10876,67,2019-10-25,1.0
2,128602.395049,2018-10-25,7019,0152f838,OH,10876,67,2019-10-25,1.0
3,447153.652892,2018-10-25,7019,0152f838,OH,10876,67,2019-10-25,1.0
4,221691.940430,2018-10-25,7019,0152f838,OH,10876,67,2019-10-25,1.0
...,...,...,...,...,...,...,...,...,...
62477,871303.164948,2017-04-07,5661,95a1ba6c,AZ,26621,74,2018-04-07,1.0
62478,452682.635286,2017-04-07,5661,95a1ba6c,AZ,26621,74,2018-04-07,1.0
62479,755761.329573,2017-04-07,5661,95a1ba6c,AZ,26621,74,2018-04-07,1.0
62480,580782.522041,2017-04-07,5661,95a1ba6c,AZ,26621,74,2018-04-07,1.0
62481,852167.671589,2017-04-07,5661,95a1ba6c,AZ,26621,74,2018-04-07,1.0